app/views/epicenter/tag_tweets.html.erb

SELECT "tweets".* FROM "tweets" INNER JOIN "tweet_tags" ON "tweets"."id" = "tweet_tags"."tweet_id" WHERE "tweet_tags"."tag_id" = ? ORDER BY "tweets"."created_at" DESC  [["tag_id", 1]]
---
  <div class="">
    <% @tag.tweets.order(created_at: :desc).each do |tweet| %>