app/controllers/epicenter_controller.rb

  def tag_tweets
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def feed
        @following_tweets = []

        Tweet.all.each do |tweet|
---
SELECT "tweets".* FROM "tweets"

  def show_user
  @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def now_following
    current_user.following.push(params[:id].to_i)
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 2\n"], ["updated_at", "2018-05-22 04:02:15.040060"], ["id", 1]]