app/controllers/tweets_controller.rb

  def create

    @tweet = Tweet.create(tweet_params)
    @tweet = get_tagged(@tweet)

    message_arr = @tweet.message.split

    respond_to do |format|
     if @tweet.save
---
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Hello, World!"], ["user_id", 1], ["created_at", "2018-05-15 03:51:56.782518"], ["updated_at", "2018-05-15 03:51:56.782518"]]
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#yo"], ["created_at", "2018-05-22 02:47:55.855514"], ["updated_at", "2018-05-22 02:47:55.855514"]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "<a href='/tag_tweets?id=1'>#yo</a> check it"], ["updated_at", "2018-05-22 02:47:55.902676"], ["id", 3]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "Heeeey, http://comicbook.com/marvel/2018/05/21/spider-man-homecoming-sequel-mysterio-kraven-the-hunter/"], ["updated_at", "2018-05-22 03:59:48.990284"], ["id", 7]]